==================================================== bash cell | import jsonld =====================================================

# Import TRO and TRS as JSON-LD and export as N-TRIPLES
geist-p create --dataset kb --inputformat json-ld --inputfile ../common/trace-vocab.jsonld --infer owl
geist-p load --dataset kb --inputformat json-ld --inputfile ../common/trs-01-minimal.jsonld
geist-p load --dataset kb --inputformat json-ld --inputfile ../common/tro-01-from-minimal-trs.jsonld

----------------------------------------------------------- cell outputs -----------------------------------------------------------
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


=================================================== bash cell | export ntriples ====================================================

# Import TRO and TRS as JSON-LD and export as N-TRIPLES
geist-p export --dataset kb --outputformat nt | sort | grep trov

----------------------------------------------------------- cell outputs -----------------------------------------------------------
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system makes all inputs available after runtime." .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "AllInputAvailableAfterRuntime" .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system makes all inputs available prior to runtime." .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "AllInputAvailableBeforeRuntime" .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object describes the full software environment." .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/2000/01/rdf-schema#label> "DescribeSoftwareEnvironment" .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system shows evidence of runtime." .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "EvidenceRuntime" .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#EvidenceRuntime> .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object includes all code." .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/2000/01/rdf-schema#label> "IncludeAllCode" .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#IncludeAllCode> .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object includes all inputs." .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/2000/01/rdf-schema#label> "IncludeAllInput" .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#IncludeAllInput> .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object includes all outputs." .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/2000/01/rdf-schema#label> "IncludeAllOutput" .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#IncludeAllOutput> .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2000/01/rdf-schema#Class> .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/2000/01/rdf-schema#label> "ObjectPolicy" .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/2000/01/rdf-schema#subClassOf> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#Policy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2000/01/rdf-schema#Class> .
<https://w3id.org/trace/2022/10/trov#Policy> <http://www.w3.org/2000/01/rdf-schema#label> "Policy" .
<https://w3id.org/trace/2022/10/trov#Policy> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system prevents internet access during execution." .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/2000/01/rdf-schema#label> "PreventInternetAccess" .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#PreventInternetAccess> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system prevents interaction with author prior to runtime." .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "PreventInterventionBeforeRuntime" .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system prevents interaction with author of package during runtime." .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "PreventInterventionDuringRuntime" .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> .
<https://w3id.org/trace/2022/10/trov#ResearchObject> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#ResearchObject> .
<https://w3id.org/trace/2022/10/trov#System> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#System> .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2000/01/rdf-schema#Class> .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/2000/01/rdf-schema#label> "SystemPolicy" .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/2000/01/rdf-schema#subClassOf> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system tracks intermediate steps." .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/2000/01/rdf-schema#label> "TrackIntermediateSteps" .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/1999/02/22-rdf-syntax-ns#Property> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2000/01/rdf-schema#label> "enforces" .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2000/01/rdf-schema#subPropertyOf> <https://w3id.org/trace/2022/10/trov#enforces> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2002/07/owl#equivalentProperty> <https://w3id.org/trace/2022/10/trov#enforces> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#enforces> .
<https://w3id.org/trace/2022/10/trov#generatedBySystem> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#generatedBySystem> .
<https://w3id.org/trace/2022/10/trov#system/01> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#system/01> .
<https://w3id.org/trace/2022/10/trov#tro/01> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ResearchObject> .
<https://w3id.org/trace/2022/10/trov#tro/01> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#tro/01> .
<https://w3id.org/trace/2022/10/trov#tro/01> <https://w3id.org/trace/2022/10/trov#generatedBySystem> <https://w3id.org/trace/2022/10/trov#system/01> .
<https://w3id.org/trace/2022/10/trov#trs/01> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#System> .
<https://w3id.org/trace/2022/10/trov#trs/01> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#trs/01> .
<https://w3id.org/trace/2022/10/trov#trs/01> <rdfs:comment> "TRS that enforces no policies." .
<https://w3id.org/trace/2022/10/trov#trs/01> <rdfs:label> "Minimal TRS" .
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


=============================================== bash cell | query comments with file ===============================================

geist-p query --dataset kb --file data/query

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | s                                                                      | o                                                                             |
|---:|:-----------------------------------------------------------------------|:------------------------------------------------------------------------------|
|  0 | <https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> | "Research system prevents interaction with author of package during runtime." |
|  1 | <https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment>      | "Research object describes the full software environment."                    |
|  2 | <https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> | "Research system prevents interaction with author prior to runtime."          |
|  3 | <https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps>           | "Research system tracks intermediate steps."                                  |
|  4 | <https://w3id.org/trace/2022/10/trov#IncludeAllCode>                   | "Research object includes all code."                                          |
|  5 | <https://w3id.org/trace/2022/10/trov#PreventInternetAccess>            | "Research system prevents internet access during execution."                  |
|  6 | <https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime>    | "Research system makes all inputs available after runtime."                   |
|  7 | <https://w3id.org/trace/2022/10/trov#IncludeAllOutput>                 | "Research object includes all outputs."                                       |
|  8 | <https://w3id.org/trace/2022/10/trov#EvidenceRuntime>                  | "Research system shows evidence of runtime."                                  |
|  9 | <https://w3id.org/trace/2022/10/trov#IncludeAllInput>                  | "Research object includes all inputs."                                        |
| 10 | <https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime>   | "Research system makes all inputs available prior to runtime."                |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================== bash cell | query comments with string ==============================================

geist-p query --dataset kb << __END_QUERY__

PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?s ?o
WHERE {
    ?s rdfs:comment ?o
}

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | s                                                                      | o                                                                             |
|---:|:-----------------------------------------------------------------------|:------------------------------------------------------------------------------|
|  0 | <https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> | "Research system prevents interaction with author of package during runtime." |
|  1 | <https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment>      | "Research object describes the full software environment."                    |
|  2 | <https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> | "Research system prevents interaction with author prior to runtime."          |
|  3 | <https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps>           | "Research system tracks intermediate steps."                                  |
|  4 | <https://w3id.org/trace/2022/10/trov#IncludeAllCode>                   | "Research object includes all code."                                          |
|  5 | <https://w3id.org/trace/2022/10/trov#PreventInternetAccess>            | "Research system prevents internet access during execution."                  |
|  6 | <https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime>    | "Research system makes all inputs available after runtime."                   |
|  7 | <https://w3id.org/trace/2022/10/trov#IncludeAllOutput>                 | "Research object includes all outputs."                                       |
|  8 | <https://w3id.org/trace/2022/10/trov#EvidenceRuntime>                  | "Research system shows evidence of runtime."                                  |
|  9 | <https://w3id.org/trace/2022/10/trov#IncludeAllInput>                  | "Research object includes all inputs."                                        |
| 10 | <https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime>   | "Research system makes all inputs available prior to runtime."                |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query trs enforced policies ==============================================

# What TRS policies are enforced by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:enforces   ?policy .
        ?policy   rdf:type        trov:SystemPolicy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName
    
__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query tro enforced policies ==============================================

# What TRO policies are enforced by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs        rdf:type        trov:System .
        ?trs        trov:enforces   ?policy .
        ?policy     rdf:type        trov:ObjectPolicy .
        ?policy     rdfs:label      ?policyName .
        ?policy     rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query all enforced policies ==============================================

# What policies are enforced by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:enforces   ?policy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query trs prevented policies =============================================

# What TRS policies are prevented by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:prevents   ?policy .
        ?policy   rdf:type        trov:SystemPolicy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query tro prevented policies =============================================

# What TRO policies are prevented by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs        rdf:type        trov:System .
        ?trs        trov:prevents   ?policy .
        ?policy     rdf:type        trov:ObjectPolicy .
        ?policy     rdfs:label      ?policyName .
        ?policy     rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query all prevented policies =============================================

# What policies are prevented by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:prevents   ?policy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


================================================== bash cell | destroy kb dataset ==================================================

geist-p destroy --dataset kb

----------------------------------------------------------- cell outputs -----------------------------------------------------------
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


