==================================================== bash cell | import jsonld =====================================================

# Import TRO and TRS as JSON-LD and export as N-TRIPLES
geist-p create --dataset kb --inputformat json-ld --inputfile ../common/trace-vocab.jsonld --infer owl
geist-p load --dataset kb --inputformat json-ld --inputfile ../common/trs-02-type-a.jsonld
geist-p load --dataset kb --inputformat json-ld --inputfile ../common/tro-02-from-type-a-trs.jsonld

----------------------------------------------------------- cell outputs -----------------------------------------------------------
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


=================================================== bash cell | export ntriples ====================================================

# Import TRO and TRS as JSON-LD and export as N-TRIPLES
geist-p export --dataset kb --outputformat nt | sort | grep trov

----------------------------------------------------------- cell outputs -----------------------------------------------------------
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system makes all inputs available after runtime." .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "AllInputAvailableAfterRuntime" .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system makes all inputs available prior to runtime." .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "AllInputAvailableBeforeRuntime" .
<https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object describes the full software environment." .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/2000/01/rdf-schema#label> "DescribeSoftwareEnvironment" .
<https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system shows evidence of runtime." .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "EvidenceRuntime" .
<https://w3id.org/trace/2022/10/trov#EvidenceRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#EvidenceRuntime> .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object includes all code." .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/2000/01/rdf-schema#label> "IncludeAllCode" .
<https://w3id.org/trace/2022/10/trov#IncludeAllCode> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#IncludeAllCode> .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object includes all inputs." .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/2000/01/rdf-schema#label> "IncludeAllInput" .
<https://w3id.org/trace/2022/10/trov#IncludeAllInput> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#IncludeAllInput> .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/2000/01/rdf-schema#comment> "Research object includes all outputs." .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/2000/01/rdf-schema#label> "IncludeAllOutput" .
<https://w3id.org/trace/2022/10/trov#IncludeAllOutput> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#IncludeAllOutput> .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2000/01/rdf-schema#Class> .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/2000/01/rdf-schema#label> "ObjectPolicy" .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/2000/01/rdf-schema#subClassOf> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#ObjectPolicy> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#ObjectPolicy> .
<https://w3id.org/trace/2022/10/trov#Policy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2000/01/rdf-schema#Class> .
<https://w3id.org/trace/2022/10/trov#Policy> <http://www.w3.org/2000/01/rdf-schema#label> "Policy" .
<https://w3id.org/trace/2022/10/trov#Policy> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system prevents internet access during execution." .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/2000/01/rdf-schema#label> "PreventInternetAccess" .
<https://w3id.org/trace/2022/10/trov#PreventInternetAccess> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#PreventInternetAccess> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system prevents interaction with author prior to runtime." .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "PreventInterventionBeforeRuntime" .
<https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system prevents interaction with author of package during runtime." .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/2000/01/rdf-schema#label> "PreventInterventionDuringRuntime" .
<https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> .
<https://w3id.org/trace/2022/10/trov#ResearchObject> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#ResearchObject> .
<https://w3id.org/trace/2022/10/trov#System> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#System> .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2000/01/rdf-schema#Class> .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/2000/01/rdf-schema#label> "SystemPolicy" .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/2000/01/rdf-schema#subClassOf> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#SystemPolicy> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#Policy> .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#SystemPolicy> .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/2000/01/rdf-schema#comment> "Research system tracks intermediate steps." .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/2000/01/rdf-schema#label> "TrackIntermediateSteps" .
<https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#TrackIntermediateSteps> .
<https://w3id.org/trace/2022/10/trov#allows> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#allows> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/1999/02/22-rdf-syntax-ns#Property> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2000/01/rdf-schema#label> "enforces" .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2000/01/rdf-schema#subPropertyOf> <https://w3id.org/trace/2022/10/trov#enforces> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2002/07/owl#equivalentProperty> <https://w3id.org/trace/2022/10/trov#enforces> .
<https://w3id.org/trace/2022/10/trov#enforces> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#enforces> .
<https://w3id.org/trace/2022/10/trov#generatedBySystem> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#generatedBySystem> .
<https://w3id.org/trace/2022/10/trov#prevents> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#prevents> .
<https://w3id.org/trace/2022/10/trov#satisfies> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#satisfies> .
<https://w3id.org/trace/2022/10/trov#system/02> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#system/02> .
<https://w3id.org/trace/2022/10/trov#tro/02> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#ResearchObject> .
<https://w3id.org/trace/2022/10/trov#tro/02> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#tro/02> .
<https://w3id.org/trace/2022/10/trov#tro/02> <https://w3id.org/trace/2022/10/trov#generatedBySystem> <https://w3id.org/trace/2022/10/trov#system/02> .
<https://w3id.org/trace/2022/10/trov#tro/02> <https://w3id.org/trace/2022/10/trov#satisfies> <https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> .
<https://w3id.org/trace/2022/10/trov#tro/02> <https://w3id.org/trace/2022/10/trov#satisfies> <https://w3id.org/trace/2022/10/trov#IncludeAllCode> .
<https://w3id.org/trace/2022/10/trov#tro/02> <https://w3id.org/trace/2022/10/trov#satisfies> <https://w3id.org/trace/2022/10/trov#IncludeAllOutput> .
<https://w3id.org/trace/2022/10/trov#trs/02> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/trace/2022/10/trov#System> .
<https://w3id.org/trace/2022/10/trov#trs/02> <http://www.w3.org/2002/07/owl#sameAs> <https://w3id.org/trace/2022/10/trov#trs/02> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#allows> <file:///mnt/trace-model/demo/03-geist-p/common/TrackIntermediateSteps> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#allows> <https://w3id.org/trace/2022/10/trov#AllInputAvailableAfterRuntime> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#allows> <https://w3id.org/trace/2022/10/trov#AllInputAvailableBeforeRuntime> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#allows> <https://w3id.org/trace/2022/10/trov#IncludeAllInput> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#allows> <https://w3id.org/trace/2022/10/trov#PreventInterventionBeforeRuntime> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#enforces> <https://w3id.org/trace/2022/10/trov#DescribeSoftwareEnvironment> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#enforces> <https://w3id.org/trace/2022/10/trov#EvidenceRuntime> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#enforces> <https://w3id.org/trace/2022/10/trov#IncludeAllCode> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#enforces> <https://w3id.org/trace/2022/10/trov#IncludeAllOutput> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#enforces> <https://w3id.org/trace/2022/10/trov#PreventInterventionDuringRuntime> .
<https://w3id.org/trace/2022/10/trov#trs/02> <https://w3id.org/trace/2022/10/trov#prevents> <https://w3id.org/trace/2022/10/trov#PreventInternetAccess> .
<https://w3id.org/trace/2022/10/trov#trs/02> <rdfs:comment> "TRS that implements a loose queue." .
<https://w3id.org/trace/2022/10/trov#trs/02> <rdfs:label> "Example Type B.1 TRS" .
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query trs enforced policies ==============================================

# What TRS policies are enforced by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:enforces   ?policy .
        ?policy   rdf:type        trov:SystemPolicy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName
    
__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | trs                                        | policyName                       | policyDescription                                                           |
|---:|:-------------------------------------------|:---------------------------------|:----------------------------------------------------------------------------|
|  0 | https://w3id.org/trace/2022/10/trov#trs/02 | EvidenceRuntime                  | Research system shows evidence of runtime.                                  |
|  1 | https://w3id.org/trace/2022/10/trov#trs/02 | PreventInterventionDuringRuntime | Research system prevents interaction with author of package during runtime. |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query tro enforced policies ==============================================

# What TRO policies are enforced by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs        rdf:type        trov:System .
        ?trs        trov:enforces   ?policy .
        ?policy     rdf:type        trov:ObjectPolicy .
        ?policy     rdfs:label      ?policyName .
        ?policy     rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | trs                                        | policyName                  | policyDescription                                        |
|---:|:-------------------------------------------|:----------------------------|:---------------------------------------------------------|
|  0 | https://w3id.org/trace/2022/10/trov#trs/02 | DescribeSoftwareEnvironment | Research object describes the full software environment. |
|  1 | https://w3id.org/trace/2022/10/trov#trs/02 | IncludeAllCode              | Research object includes all code.                       |
|  2 | https://w3id.org/trace/2022/10/trov#trs/02 | IncludeAllOutput            | Research object includes all outputs.                    |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query all enforced policies ==============================================

# What policies are enforced by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:enforces   ?policy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | trs                                        | policyName                       | policyDescription                                                           |
|---:|:-------------------------------------------|:---------------------------------|:----------------------------------------------------------------------------|
|  0 | https://w3id.org/trace/2022/10/trov#trs/02 | DescribeSoftwareEnvironment      | Research object describes the full software environment.                    |
|  1 | https://w3id.org/trace/2022/10/trov#trs/02 | EvidenceRuntime                  | Research system shows evidence of runtime.                                  |
|  2 | https://w3id.org/trace/2022/10/trov#trs/02 | IncludeAllCode                   | Research object includes all code.                                          |
|  3 | https://w3id.org/trace/2022/10/trov#trs/02 | IncludeAllOutput                 | Research object includes all outputs.                                       |
|  4 | https://w3id.org/trace/2022/10/trov#trs/02 | PreventInterventionDuringRuntime | Research system prevents interaction with author of package during runtime. |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query trs prevented policies =============================================

# What TRS policies are prevented by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:prevents   ?policy .
        ?policy   rdf:type        trov:SystemPolicy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | trs                                        | policyName            | policyDescription                                          |
|---:|:-------------------------------------------|:----------------------|:-----------------------------------------------------------|
|  0 | https://w3id.org/trace/2022/10/trov#trs/02 | PreventInternetAccess | Research system prevents internet access during execution. |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query tro prevented policies =============================================

# What TRO policies are prevented by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs        rdf:type        trov:System .
        ?trs        trov:prevents   ?policy .
        ?policy     rdf:type        trov:ObjectPolicy .
        ?policy     rdfs:label      ?policyName .
        ?policy     rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
| trs   | policyName   | policyDescription   |
|-------|--------------|---------------------|
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


============================================= bash cell | query all prevented policies =============================================

# What policies are prevented by the TRS?

geist-p query --dataset kb << __END_QUERY__

    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX trov: <https://w3id.org/trace/2022/10/trov#>

    SELECT DISTINCT ?trs ?policyName ?policyDescription
    WHERE {
        ?trs      rdf:type        trov:System .
        ?trs      trov:prevents   ?policy .
        ?policy   rdfs:label      ?policyName .
        ?policy   rdfs:comment    ?policyDescription .
    } ORDER BY ?trs ?policyName

__END_QUERY__

----------------------------------------------------------- cell outputs -----------------------------------------------------------
|    | trs                                        | policyName            | policyDescription                                          |
|---:|:-------------------------------------------|:----------------------|:-----------------------------------------------------------|
|  0 | https://w3id.org/trace/2022/10/trov#trs/02 | PreventInternetAccess | Research system prevents internet access during execution. |
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


================================================== bash cell | destroy kb dataset ==================================================

geist-p destroy --dataset kb

----------------------------------------------------------- cell outputs -----------------------------------------------------------
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^


